#include "msp430.h"

// Стойности на позиции на сгментите
const int segment_poss[6] = 
{
        9,      // Сегмент A1 започва от S18 
        5,      // Сегмент A2 започва от S10 
        3,      // Сегмент A3 започва от S6  
        18,     // Сегмент A4 започва от S36 
        14,     // Сегмент A5 започва от S28 
        7      // Сегмент A6 започва от S14
} 

// Стойности на седментите за изобразяване на цифри
const char digit[10][2] =
{
    {0xFC, 0x28},  // "0"
    {0x60, 0x20},  // "1"
    {0xDB, 0x00},  // "2"
    {0xF3, 0x00},  // "3"
    {0x67, 0x00},  // "4"
    {0xB7, 0x00},  // "5"
    {0xBF, 0x00},  // "6"
    {0xE4, 0x00},  // "7"
    {0xFF, 0x00},  // "8"
    {0xF7, 0x00}   // "9"
};

// Стойности на седментите за изобразяване на главни букви
const char alphabetBig[26][2] =
{
    {0xEF, 0x00},  // "A"
    {0xF1, 0x50},  // "B"
    {0x9C, 0x00},  // "C"
    {0xF0, 0x50},  // "D"
    {0x9F, 0x00},  // "E"
    {0x8F, 0x00},  // "F"
    {0xBD, 0x00},  // "G"
    {0x6F, 0x00},  // "H"
    {0x90, 0x50},  // "I"
    {0x78, 0x00},  // "J"
    {0x0E, 0x22},  // "K"
    {0x1C, 0x00},  // "L"
    {0x6C, 0xA0},  // "M"
    {0x6C, 0x82},  // "N"
    {0xFC, 0x00},  // "O"
    {0xCF, 0x00},  // "P"
    {0xFC, 0x02},  // "Q"
    {0xCF, 0x02},  // "R"
    {0xB7, 0x00},  // "S"
    {0x80, 0x50},  // "T"
    {0x7C, 0x00},  // "U"
    {0x0C, 0x28},  // "V"
    {0x6C, 0x0A},  // "W"
    {0x00, 0xAA},  // "X"
    {0x00, 0xB0},  // "Y"
    {0x90, 0x28}   // "Z"
};

void lcd_init(void);
void lcd_print(char *buff);
void lcd_put_char(char in_char, int position);
void lcd_clear(void);